Revit 2024 API
BuiltInFailures.DesignOptionFailures.MustBeInMainModel Property
 Element must be in Main Model
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MustBeInMainModel { get; }
Visual Basic
Public Shared ReadOnly Property MustBeInMainModel As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MustBeInMainModel {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace